tutorials/verificationAndValidation/axisymmetricHemispherical/sim/interPhaseChangeFoam/cavNum04/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (water vapour);

phaseChangeTwoPhaseMixture SchnerrSauer;

pSat            2339;   // Saturation pressure

sigma           0.07;

water
{
    transportModel  Newtonian;
    nu              1.002e-6;
    rho             998.0;
}

vapour
{
    transportModel  Newtonian;
    nu              5.882e-04;
    rho             0.017;
}

KunzCoeffs
{
    UInf            U20.0;
    tInf            0.005; // L = 0.1 m
    Cc              C1000;
    Cv              C1000;
}

MerkleCoeffs
{
    UInf            20.0;
    tInf            0.005;  // L = 0.1 m
    Cc              80;
    Cv              1e-03;
}

SchnerrSauerCoeffs
{
    n               1.6e+13;
    dNuc            2.0e-06;
    Cc              1;
    Cv              1;
}


// ************************************************************************* //
